; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v2 - type_3 ?v7 - type_1)
 	      (pred_3 ?v8 - object ?v7 - type_1)
	      (pred_2 ?v2 - type_3 ?v5 - type_2)
	      (pred_4 ?v2 - type_3 ?v8 - object ?v5 - type_2))

   (:action op_3
       :parameters  (?v2 - type_3 ?v6 ?v4 - type_1)
       :precondition (and  (pred_1 ?v2 ?v6))
       :effect (and  (pred_1 ?v2 ?v4)
		     (not (pred_1 ?v2 ?v6))))

   (:action op_2
       :parameters (?v2 - type_3 ?v1 - object ?v3 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v1 ?v3) (pred_1 ?v2 ?v3) (pred_2 ?v2 ?v5))
       :effect (and (pred_4 ?v2 ?v1 ?v5)
		    (not (pred_3 ?v1 ?v3)) 
		    (not (pred_2 ?v2 ?v5))))

   (:action op_1
       :parameters (?v2 - type_3 ?v1 - object ?v3 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v1 ?v5) (pred_1 ?v2 ?v3))
       :effect (and (pred_3 ?v1 ?v3)
		    (pred_2 ?v2 ?v5)
		    (not (pred_4 ?v2 ?v1 ?v5)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_09 - type_3
obj_05 obj_07 - type_2
obj_08 obj_02 obj_04 - type_1
obj_01 obj_03 obj_06 - object)
(:init
(pred_1 obj_09 obj_04)
(pred_2 obj_09 obj_05)
(pred_2 obj_09 obj_07)
(pred_3 obj_01 obj_04)
(pred_3 obj_03 obj_08)
(pred_3 obj_06 obj_04)
)
(:goal
(and
(pred_3 obj_01 obj_08)
(pred_3 obj_03 obj_04)
(pred_3 obj_06 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_09 ?b obj_07))))
)
)

; plan
1. (op_2 obj_09 obj_01 obj_04 obj_05)
   deleted: (pred_3 obj_01 obj_04) (pred_2 obj_09 obj_05)
   added: (pred_4 obj_09 obj_01 obj_05)
   goals met: 1 of 3
2. (op_3 obj_09 obj_04 obj_08)
   deleted: (pred_1 obj_09 obj_04)
   added: (pred_1 obj_09 obj_08)
   goals met: 1 of 3
3. (op_1 obj_09 obj_01 obj_08 obj_05)
   deleted: (pred_4 obj_09 obj_01 obj_05)
   added: (pred_3 obj_01 obj_08) (pred_2 obj_09 obj_05)
   goals met: 2 of 3
4. (op_2 obj_09 obj_03 obj_08 obj_05)
   deleted: (pred_3 obj_03 obj_08) (pred_2 obj_09 obj_05)
   added: (pred_4 obj_09 obj_03 obj_05)
   goals met: 2 of 3
5. (op_3 obj_09 obj_08 obj_04)
   deleted: (pred_1 obj_09 obj_08)
   added: (pred_1 obj_09 obj_04)
   goals met: 2 of 3
6. (op_1 obj_09 obj_03 obj_04 obj_05)
   deleted: (pred_4 obj_09 obj_03 obj_05)
   added: (pred_3 obj_03 obj_04) (pred_2 obj_09 obj_05)
   goals met: 3 of 3
